[General]
Version=1.8.8
LanguageName=العربية 
lblLanguageAuthor=Cheatos-SBi
RightToLeft=true

[Form1]
lblLanguage=اللغة:
TorrentFileLabel=المسار:
closeButton=اغلاق
StartButton=ابدأ
tabGeneral=عام
groupTorrentFile=ملف التورينت
browseButton=تحديد...
groupStats=الاحصائيات
totalRunningTimeLabel=الوقت الكلي:
leechLabel=محملين:
seedLabel=رافعين:
manualUpdateButton=تحديث يدوي
labelUpdateIn=يتم التحديث في:
downloadCountLabel=تم تحميل:
uploadCountLabel=تم رفع:
groupBoxOptions=خيارات
applyStopSettingsButton=تطبيق
stopProcessLabel=توقف
FileSizeLabel=منتهي (%)
uploadRateLabel=سرعة الرفع (ك.ب/ث) :
downloadRateLabel=سرعة التحميل (ك.ب/ث) :
groupTorrentInfo=معلومات التورينت
labelTorrentSize=الحجم:
hashLabel=SHA Hash:
TrackerLabel=التراكر:
tabAdvanced=خيارات متقدمة
memoryReaderButton=قارىء الذاكرة
updateAnnounceParamsOnStart=تحديث peer_id و key عند تشغيل راشيو ماستر
checkNewVersion=ابحث عن التحديثات
checkShowTrayBaloon=أظهر بالون عند شريط المهام
ClientLabel=محاكاة برنامج:
randomSpeedGroup=توليد قيم عشوائية لسرعة الرفع والتحميل
RandomDownloadToLabel=أقصى حد:
RandomUploadToLabel=أقصى حد:
RandomDownloadFromLabel=أقل حد:
RandomUploadFromLabel=أقل حد:
checkRandomDownload=تحميل (ك.ب)
checkRandomUpload=رفع  (ك.ب)
reportParamsGroup=خصائص الاعلان
keyLabel=Key (key):
labelPeerID=Peer ID (peer_id):
numwantLabel=عدد البييرز(numwant):
portInfoLabel=اذا كانت المربعات ادناه فارغه ,ستتم تعبئتها من قبل راشيو ماستر
portLabel=المنفذ:
tabNetwork=الشبكة
groupNetworkMisc=أخرى
checkIgnoreFailureReason=اهمال 'failure reason'
labelStopMinLeecher=توقف عن الرفع عندما يكون عدد المحملين أقل من:
intervalLabel=مدة تحديث التراكر (ث):
checkRequestScrap=أحضر البييرز من التراكر (scrape)
checkTCPListen=استخدم TCP Listener لتظهر Connectable
proxySettingsGroup=خيارات البروكسي
labelProxyPass=كلمة المرور:
labelProxyUser=اسم المستخدم:
labelProxyPort=المنفذ:
labelProxyHost=المستضيف:
labelProxyType=نوع البروكسي:
tabLog=لائحة الاحداث
saveLogButton=حفظ الاحداث
checkLogEnabled=تفعيل
clearLogButton=تفريغ الاحداث
tabAbout=عن البرنامج
labelForums=المنتديات:
labelWebSite=الموقع:
StopButton=توقف
linkProxyHelp=مساعدة بخصوص البروكسي
tabUpdates=التحديثات
installUpdatesButton=ثبت التحديثات
checkUpdatesButton=البحث عن التحديثات
labelUpdates=ملفات برامج التورينت واللغات
labelBindIp=الربط بIP:
checkMinimizeToTray=تصغير الى شريط المهام
checkIgnoreTimeout=اهمال اخطاء الاتصال
checkUPnP=تفعيل خاصية UPnP port mapping
testNetworkButton=اختبر الخيارات...
ResetCountersButton=أعد العدادات
checkSavePeers=خزن لائحة البييرز


[MemoryReader]
reApplyButton=تطبيق
reCloseButton=اغلاق
groupBoxSearchResults=نتائج البحث
reHashLabel=Hash:
rePeerIdLabel=Peer ID(peer_id):
reKeyLabel=Key(key):
numwantLabel=عدد البييرز (numwant):
rePortLabel=المنفذ:
reSearchStrLabel=النص:
reSearchButton=ابدأ البحث
reProcessNameLabel=اسم التطبيق:

[Messages]
mrNoProcessFound=لم يتم العثور على {0} التطبيق .\r\nتأكد ان برنامج التورينت يعمل بملف واحد على الاقل
mrSearchFail=فشل البحث.\r\nتأكد ان برنامج التورينت يعمل بملف واحد على الاقل
mrSearchTitle=ابحث
mrSearchSuccess=تم البحث بنجاح!\r\nاضغط تطبيق لحفظ البيانات المستخرجة
vrNewVersionReleased=يوجد اصدار جديد! احصل عليه من www.moofdev.net
vrNewVersionTitle="يوجد اصدار جديد للبرنامج!"
ballonUploaded=تم رفع: {0} \r\n
ballonDownloaded=تم تحميل: {0} \r\n
ballonUpdateIn=التحديث في {0} \r\n
ballonTotalTime=الوقت الكلي: {0} \r\n
stopProcessOpt1=لا تتوقف
stopProcessOpt2=بعد رفع
stopProcessOpt3=بعد تحميل
stopProcessOpt4=بعد مضي وقت
stopProcessUnits1=ثواني
stopProcessUnits2=دقائق
stopProcessUnits3=ساعات
restoreToolStripMenuItem=استعادة
exitToolStripMenuItem=خروج
umNumUpdatesFound=تم العثور على {0} تحديثات
umNoUpdatesFound=لا توجد تحديثات جديدة
umParsingUpdates=يتم معالجة التحديثات...
umCheckingUpdates=جاري البحث عن تحديثات...
umDownloadingUpdate=يتم تحميل التحديثات... {0}
umFinishedDownloadingUpdates=تحميل تحميل التحديثات
clmnUpdateName=الاسم
clmnUpdateFileName=اسم الملف
clmnUpdateType=النوع
clmnUpdateAuthor=بواسطة
confirmCloseTitle=تأكيد
confirmCloseMessage=يتم الان التحديث , هل تريد حقا اغلاق البرنامج؟
defaultBinding=افتراضي
testNetworkSuccess=تم الاتصال بنجاح, خيارات الشبكة الحالة تعمل جيدا
testNetworkFailed=خطأ في الاتصال
testNetworkInProgress=جاري اختبار الشبكة...

[Tooltips]
checkIgnoreFailureReason=راشيو ماستر سيهمل الاخطاء الواردة من التراكر وسيكمل الرفع اذا تم تفعيل هذا الخيار
labelStopMinLeecher=يمكن لراشيو ماستر تصفير سرعة الرفع اذا كان عدد المحملين أقل من القيمة المختارة
intervalLabel=القيمة الافتراضية لوقت التبيلغ الى التراكر\r\nمفيد لبعض التراكرات اللذين لا يعيدوا وقت للتحديث
proxySettingsGroup=يمكنك استخدام بروكسي للتبليغ الى التراكر لاخفاء الاي بي الخاص بك
memoryReaderButton=قارىء الذاكرة\r\nاستخدم هذه الاداة عندما تريد خيارات peer_id, key, منفذ وأخرى لتطابق برنامج التورينت.
updateAnnounceParamsOnStart=عند تفعيل هذا الخيار, سيقوم راشيو ماستر بتوليد قسم peer_id و key في كل مرة يتم فيها تشغيل راشيو ماستر.\r\nاذا كان الخيار غير مفعل سيتم استخدام القيم من المرة الماضية.
TorrentClientsBox=اختار برنامج التورينت الذي تود محاكاته
randomSpeedGroup= يمكن لراشيو ماستر توليد قيم عشوائية للسرعات \r\nتبعا لهذه الخيارات.\r\nلأن الرفع بسرعة ثابتة قد يكون مشبوها به.
torrentFile=مسار ملف التورينت\r\nاضغط تحديد... او اسحب وافلت التورينت على نافذة البرنامج.
totalRunningTimeLabel=الوقت الكلي المستغرق لهذه الجلسة
leechLabel=المحملين على هذا التورينت\r\n هذه المعلومة غير مدعومة عند كل التراكرات
seedLabel=الرافعين على هذا التورينت\r\n هذه المعلومة غير مدعومة في كل التراكرات
manualUpdateButton=تحديث يدوي\r\nيمكنك تحديث التراكر حالا وملاحظة التعديلات مباشرة
labelUpdateIn=الوقت حتى التحديث التالي
downloadCountLabel=تم تحميل\r\nبعد التحديث سترى النتائج في التراكر
uploadCountLabel=تم رفع\r\nبعد التحديث سترى النتائج في التراكر
checkIgnoreTimeout=سيهمل راشيو ماستر اخطاء الاتصال اذا تم تفعيل هذا الخيار
stopProcessActionBox=يمكن لراشيو ماستر انهاء العمليات اوتوماتكيا\r\nاختار أحد الخيارات وادخل له قيمة.
uploadRate=سرعة الرفع\r\nضع هنا سرعة الرفع التي سيبلغها راشيو ماستر الى التراكر
downloadRate=سرعة التحميل\r\nضع هنا سرعة التحميل التي سيبلغها راشيو ماستر الى التراكر
shaHash=Torrent Sha Hash\r\nيمكنك ادخال القيمة يدويا او سيتم توليدها من ملف التورينت المختار
trackerAddress=عنوان التراكر\r\nيمكنك ادخال القيمة يدويا او سيتم توليدها من ملف التورينت المختار
fileSize=نسبة التحميل %\r\nيمكنك ادخال قيمة وهمية لما تم تحميله\r\n100% = لتظهر رافع(سيدر)\r\n0%     = تحميل التورينت وهميا من البداية\r\nراشيو ماستر يتذكر نسبة التحميل وخيارات اخرى لكل تورينت
reportParamsGroup=هذه الخيارات هي جزء مهم من الاعلان الذي يرسله راشيو ماستر الى التراكرك.\r\nعادة يقوم راشيو ماستر بتعبئة الخيارات اوتوماتيكيا,لكنه لديك الخيار\r\nلادخال القيم يدويا أو لتستخدم قارىء الذاكرة لتعبئتهم.
reProcessNameBox=سيقوم راشيو ماستر بالبحث عن هذا التطبيق\r\nراشيو ماستر يعبئ هذا المربع اوتوماتيكيا تبعا لخيارت برنامج التورينت المختار حالية.
reSearchStr=يبحث راشيو ماستر عن هذا النص حتى يجد عنوان الاعلان(التحديث) ثم يعالج نتائج البحث.
reSearchButton=اضغط على ابدأ البحث .. لبدأ البحث
groupBoxSearchResults=اذا نجح البحث سيقوم راشيو ماستر بتعبئة الخانات بالنتائج المعثور عليها.\r\nانسخ هذا القيم يدويا الى تبوب متقدم في راشيو ماستر او اضغط على تطبيق
reApplyButton=اضغط على تطبيق لنسخ نتائج البحث الى تبويب متقدم في راشيو ماستر